Repository: imtiredxtrnl/gesture_diplom
Catalog: lib/l10n/app_*.arb
Languages: uk

# appTitle
source: Sign Language App
uk: Додаток жестової мови

source: Login
uk: Увійти

source: Register
uk: Реєстрація

source: Email
uk: Електронна пошта

source: Password
uk: Пароль

source: Name
uk: Ім'я

source: Sign In
uk: Увійти

source: Sign Out
uk: Вийти

source: No account?
uk: Немає акаунта?

source: Create Account
uk: Створити акаунт

source: Confirm Password
uk: Підтвердіть пароль

# enter_email_password
source: Enter email and password
uk: Введіть email та пароль

# validation_all_fields_required
source: All fields are required
uk: Всі поля обов'язкові

# validation_passwords_do_not_match
source: Passwords do not match
uk: Паролі не співпадають

source: Registration in progress...
uk: Реєстрація...

# registration_success
source: Registration successful!
uk: Реєстрація успішна!

source: Registration error
uk: Помилка реєстрації

source: Connection error
uk: Помилка з'єднання

source: Connection closed before response
uk: З'єднання закрито до відповіді

source: Connection error to server
uk: Помилка з'єднання з сервером

source: User not authorized
uk: Користувач не авторизований

source: Edit Profile
uk: Редагувати профіль

source: Save Changes
uk: Зберегти зміни

source: Logout
uk: Вийти

# confirm_logout
source: Are you sure you want to logout?
uk: Ви впевнені, що хочете вийти?

source: Cancel
uk: Скасувати

source: Reset
uk: Скинути

source: Reset Progress
uk: Скинути прогрес

# confirm_reset_progress
source: Are you sure you want to reset your progress?
uk: Ви впевнені, що хочете скинути прогрес?

source: Progress reset!
uk: Прогрес скинуто!

source: Tests completed
uk: Пройдено тестів

source: Level
uk: Рівень

source: Beginner
uk: Початківець

source: Intermediate
uk: Середній

source: Experienced
uk: Досвідчений

source: Expert
uk: Експерт

source: Statistics
uk: Статистика

source: Language
uk: Мова

source: Ukrainian
uk: Українська

source: English
uk: Англійська

source: Profile
uk: Профіль

source: Not authorized
uk: Не авторизовано

# please_login
source: Please log in to continue
uk: Увійдіть, щоб продовжити

source: Tests
uk: Тести

source: Test
uk: Тест

source: Check Answer
uk: Перевірити відповідь

source: Finish
uk: Завершити

# choose_correct_answer
source: Choose the correct answer
uk: Оберіть правильну відповідь

source: Correct!
uk: Правильно!

source: Incorrect
uk: Неправильно

source: Category
uk: Категорія

source: Completed
uk: Завершено

source: Add Test
uk: Додати тест

source: Edit Test
uk: Редагувати тест

source: Delete Test
uk: Видалити тест

# confirm_delete_test
source: Are you sure you want to delete this test?
uk: Ви впевнені, що хочете видалити цей тест?

source: Search tests...
uk: Пошук тестів...

source: Options
uk: Варіанти

source: Option
uk: Варіант

source: Answer Options
uk: Варіанти відповіді

# validation_test_question
source: Enter the test question
uk: Введіть питання тесту

# validation_option
source: Enter the answer option
uk: Введіть варіант відповіді

source: Add Gesture
uk: Додати жест

source: Edit Gesture
uk: Редагувати жест

source: Delete Gesture
uk: Видалити жест

# confirm_delete_gesture
source: Are you sure you want to delete this gesture?
uk: Ви впевнені, що хочете видалити цей жест?

# delete_gesture_cannot_be_undone
source: This action cannot be undone!
uk: Цю дію не можна скасувати!

source: Gesture
uk: Жест

source: Gestures
uk: Жести

source: Gestures Dictionary
uk: Словник жестів

# gestures_dictionary_description
source: Browse all available gestures
uk: Перегляньте всі доступні жести

# gestures_practice
source: Practice Gestures
uk: Практика жестів

# gestures_practice_description
source: Practice recognizing and showing gestures
uk: Тренуйте розпізнавання та показ жестів

# gestures_alphabet
source: Alphabet
uk: Алфавіт

# gestures_alphabet_description
source: Learn the sign language alphabet
uk: Вивчайте дактильний алфавіт

# gestures_tests
source: Tests
uk: Тести

# gestures_tests_description
source: Test your knowledge of gestures
uk: Перевірте знання жестів

source: Search gestures...
uk: Пошук жестів...

source: Loading gestures...
uk: Завантаження жестів...

source: No gestures found
uk: Жести не знайдено

# no_gestures_in_category
source: No gestures in this category
uk: У цій категорії немає жестів

source: Try Again
uk: Спробувати ще раз

source: Refresh
uk: Оновити

source: Add Image
uk: Додати зображення

source: Delete
uk: Видалити

source: Edit
uk: Редагувати

source: Save
uk: Зберегти

source: Main Info
uk: Основна інформація

source: Gesture Name
uk: Назва жесту

source: Gesture Description
uk: Опис жесту

# gesture_description_hint
source: Describe the gesture...
uk: Опишіть жест...

# validation_gesture_name
source: Enter the gesture name
uk: Введіть назву жесту

# validation_gesture_name_length
source: Gesture name is too short
uk: Назва жесту закоротка

# validation_gesture_description
source: Enter the gesture description
uk: Введіть опис жесту

# validation_gesture_description_length
source: Description is too short
uk: Опис закороткий

source: Gesture Image
uk: Зображення жесту

# gesture_image_hint
source: Add a photo or illustration of the gesture
uk: Додайте фото або ілюстрацію жесту

source: Image selected
uk: Зображення вибрано

source: Change Image
uk: Змінити зображення

source: Select Image
uk: Вибрати зображення

source: Image not selected
uk: Зображення не вибрано

# click_button_below_to_select
source: Click the button below to select an image
uk: Натисніть кнопку нижче, щоб вибрати зображення

source: Create Gesture
uk: Створити жест

source: Saving gesture...
uk: Збереження жесту...

# success_gesture_added
source: Gesture added successfully!
uk: Жест успішно додано!

# error_gesture_addition
source: Error adding gesture
uk: Помилка додавання жесту

# error_gesture_saving
source: Error saving gesture
uk: Помилка збереження жесту

# success_gesture_update
source: Gesture updated successfully!
uk: Жест успішно оновлено!

# error_gesture_update
source: Error updating gesture
uk: Помилка оновлення жесту

# error_gesture_save
source: Error saving gesture
uk: Помилка збереження жесту

# error_image_selection
source: Error selecting image
uk: Помилка вибору зображення

# error_image_picker
source: Error picking image
uk: Помилка вибору зображення

source: Tip
uk: Порада

# tip_description
source: Use clear and high-quality images for best results.
uk: Використовуйте чіткі та якісні зображення для кращого результату.

source: Add Letter
uk: Додати літеру

source: Edit Letter
uk: Редагувати літеру

source: Delete Letter
uk: Видалити літеру

source: Letter
uk: Літера

source: Letters
uk: Літери

source: Alphabet
uk: Алфавіт

source: Ukrainian Alphabet
uk: Український алфавіт

# ukrainian_alphabet_description
source: Learn the Ukrainian sign language alphabet
uk: Вивчайте український дактильний алфавіт

source: English Alphabet
uk: Англійський алфавіт

# english_alphabet_description
source: Learn the English sign language alphabet
uk: Вивчайте англійський дактильний алфавіт

source: Select
uk: Обрати

source: Image not loaded (demo)
uk: Зображення не завантажено (демо)

# add_first_gesture
source: Add the first gesture
uk: Додайте перший жест

source: Admin Panel
uk: Адмін-панель

source: Gestures Management
uk: Керування жестами

# gestures_management_desc
source: Add, edit or delete gestures
uk: Додавайте, редагуйте або видаляйте жести

source: Tests Management
uk: Керування тестами

# tests_management_desc
source: Add, edit or delete tests
uk: Додавайте, редагуйте або видаляйте тести

source: Total users
uk: Всього користувачів

# gestures_in_dict
source: Gestures in dictionary
uk: Жестів у словнику

source: Test Question
uk: Питання тесту

source: Success
uk: Успіх

source: Error
uk: Помилка

source: Loading...
uk: Завантаження...

source: Camera
uk: Камера

source: Initializing camera...
uk: Ініціалізація камери...

source: Camera not initialized
uk: Камеру не ініціалізовано

source: Initialize Camera
uk: Ініціалізувати камеру

source: Recognized Gesture
uk: Розпізнаний жест

source: Practice with Camera
uk: Практика з камерою

source: Mark as Learned
uk: Позначити як вивчено

source: Learned!
uk: Вивчено!

source: Description
uk: Опис

# follow_instructions
source: Follow the instructions
uk: Дотримуйтесь інструкцій

# practice_instruction
source: Practice the gesture as shown
uk: Практикуйте жест як показано

# practice_step1
source: Step 1: Position your hand in front of the camera
uk: Крок 1: Розташуйте руку перед камерою

# practice_step2
source: Step 2: Repeat the gesture
uk: Крок 2: Повторіть жест

# practice_step3
source: Step 3: Wait for recognition
uk: Крок 3: Дочекайтеся розпізнавання

# practice_step4
source: Step 4: Mark as learned
uk: Крок 4: Позначте як вивчено

# practice_step5
source: Step 5: Continue practicing
uk: Крок 5: Продовжуйте практикувати

# practice_hint
source: Try to repeat the gesture as accurately as possible
uk: Намагайтеся повторити жест якомога точніше

source: Gesture not detected
uk: Жест не розпізнано

source: Open Palm
uk: Відкрита долоня

source: Fist
uk: Кулак

source: Thumbs Up
uk: Палець вгору

source: Victory
uk: Вікторі

source: Pointing
uk: Вказівний

source: Rock
uk: Рок

source: Unknown Gesture
uk: Невідомий жест

source: Show Gesture
uk: Показати жест

# step
source: Step {step} of {total}
uk: Крок {step} з {total}

# time_up
source: Time's up!
uk: Час вийшов!

# time_up_message
source: You ran out of time. Try again!
uk: Час вичерпано. Спробуйте ще раз!

source: Return to Dictionary
uk: Повернутися до словника

source: Image unavailable
uk: Зображення недоступне

source: Gesture ID
uk: ID жесту

source: Gesture Data
uk: Дані жесту

source: Edit Gesture Info
uk: Редагувати інформацію про жест

source: Unsaved Changes
uk: Незбережені зміни

# unsaved_changes_confirm
source: You have unsaved changes. Exit without saving?
uk: У вас є незбережені зміни. Вийти без збереження?

source: Stay
uk: Залишитись

source: Exit without saving
uk: Вийти без збереження

source: Found
uk: Знайдено

source: Total gestures
uk: Всього жестів

source: No gestures to display
uk: Немає жестів для відображення

# try_again_with_different_search
source: Try again with a different search
uk: Спробуйте інший пошук

# validation_username
source: Enter a username
uk: Введіть ім'я користувача

source: Error loading gestures
uk: Помилка завантаження жестів

source: Error deleting gesture
uk: Помилка видалення жесту

source: Gesture marked as learned!
uk: Жест позначено як вивчений!

# success_message
source: You have successfully learned the gesture {gesture}!
uk: Ви успішно вивчили жест {gesture}!

source: Registration
uk: Реєстрація

source: Admin
uk: Адмін

source: User
uk: Користувач

source: Reset tests
uk: Скинути тести

source: deleted
uk: видалено

# gestures_not_found
source: No gestures found
uk: Жести не знайдено

source: Correct answer
uk: Правильна відповідь

source: No tests
uk: Немає тестів

source: Alphabet selection
uk: Вибір алфавіту

source: No letters
uk: Немає літер

source: Dictionary
uk: Словник

source: Saving changes...
uk: Збереження змін...

source: Username
uk: Ім'я користувача

source: Select gesture
uk: Виберіть жест

source: Saving letter...
uk: Збереження літери...

# please_enter_letter
source: Please enter a letter
uk: Введіть літеру

# enter_ukrainian_letter
source: Enter a Ukrainian letter
uk: Введіть українську літеру

# enter_english_letter
source: Enter an English letter
uk: Введіть англійську літеру

source: Letter deleted
uk: Літеру видалено

source: Error deleting
uk: Помилка видалення

source: Error deleting letter
uk: Помилка видалення літери

source: Alphabet management
uk: Керування алфавітом

source: Letter data
uk: Дані літери

source: Enter letter
uk: Введіть літеру

# unsaved_changes_message
source: You have unsaved changes. Please save or discard them before leaving.
uk: У вас є незбережені зміни. Будь ласка, збережіть або скасуйте їх перед виходом.

source: Editing Test
uk: Редагування тесту

source: Test ID
uk: ID тесту

# validation_test_question_length
source: The test question is too short.
uk: Питання тесту закоротке.

source: Answer option
uk: Варіант відповіді
